[
    {
        "id": 1,
        "title":"Rensource deploys Solar Energy System to 2-Way Steel Works Nigeria Ltd ",
        "content": "Rensource, West Africa’s leading SME focused renewable energy company, in partnership with Stellaris Power Solutions (SPS), has deployed a 300kWp solar PV for 2-Way Steel Works Nigeria Ltd, a steel manufacturing company in Kaduna, Nigeria. The solar PV plant will generate 0.5GWh of energy annually and offset over four-thousand tons of carbon throughout the project’s lifetime, improving air quality and benefiting health outcomes in the country. 2-Way Steel Works Nigeria Ltd has thus set the pace to be one of the largest installed solar PV in the steel manufacturing industry in Nigeria. The project, which commenced operations in March 2022, will have an important footprint in terms of sustainability. It will save up to 360 tons of CO2emissions per year and create 20 jobs during its construction and operations phase.\n Since venturing into providing Commercial and Industrial (C&I) Renewable Energy solutions to businesses & industries in 2019 with its flagship project in Premium Poultry Abuja, Rensource Energy has signed PPAs to provide over 5MWp of installed solar PV capacity across Nigeria and projects to construct 12MWp by the end of the year.\n According to the Council for Renewable Energy Nigeria (CREN), Nigeria has been affected by insufficient power supply which has largely contributed to the paralyzing of industrial and commercial activities in the country. CREN estimates that power outages brought about a loss of 126 billion naira annually. Aside from the huge income loss, it has also resulted in health difficulty because of the exposure to carbon emissions caused by constant use of generators in different households and businesses, unemployment, and high cost of living leading to the degeneration of living conditions. Generators remain inadequate to satisfy the needs of Nigeria. As such, solar energy becomes a great solution as it is cheaper and reduces carbon emissions, which lessens the effect of climate change.\n This project will represent the steel manufacturing industry’s largest renewable energy project. The solar PV is expected to operate for 15 years according to the power purchase agreement (PPA).\n Commenting on the deployment, Rensource’s COO Prince Ojeabulu said “We are honored to partner with 2-Way Steel Works Nigeria Ltd to provide a state-of-the-art PV solution that generates cheap and clean energy to power 2-Way Steel Works production activities. This successful completion of the PV plant represents Rensource’s commitment to continue to bridge the energy gap hampering economic growth in Nigeria.”\n Mr Clement U. Ejeh the CEO/Chairman of 2 Way Steel was also elated by the project, according to him “For years, as big players in steel construction, requiring high electric power to produce, we have had to grapple with the epileptic supply from grid, resulting in high production cost and loss of revenue. Today, that is history, as we operate at full capacity, towering above production targets, all thanks to God that brought Stellaris Power Solutions & Rensource Energy our way! Our power partners come with the rising sun!” \n About Rensource Energy \n Rensource is a leading West African provider of renewable energy related services, it specializes in the development and financing of solar-hybrid captive power provision which provides commercial, industrial, and utility customers, solutions that bridge the gap between desired and available power. Rensource deploys any combination of solar power and fossil-fired power, primarily gas and diesel but also including natural gas with appropriate battery storage solutions. Rensource has proven itself with a track record of reliability and consistency in the region.\n  About 2-Way Steel \n 2-Way Steel Works Limited is a world class steel manufacturing company into the production of quality fabrication of iron and steel. 2-Way Steel creates the unimaginable with iron to suit clients’ needs, these include silo, palletized, box, container, flat bird, tankers, LPG Bodies amongst others.\n About Stellaris Power Solutions \n Stellaris Power Solutions is the leading EPC and Engineering Services company with a regional footprint across Africa and the Middle East. Stellaris provides turnkey design, supply, and installation for utility-scale solar tracker projects. As GameChange Solar’s certified, trusted partner and the market’s leading provider of GENIUS TRACKERTM, Stellaris helps its customers meet their renewable energy goals with simple, seamless project execution.\n Reference: Rensource deploys Solar Energy System to 2-Way Steel Works Nigeria Ltd",
        "image": "../../assets/Press Release/Image.png",
        "date": "April 29, 2022"
    },
    {
        "id": 2,
        "title":"Solar providers in Africa are on a collision course with struggling national grid companies ",
        "content": "An enduring moment from former US president Barack Obama’s visit to Kenya in 2015 was a quick chat with the founders of home solar power provider, M-Kopa at the Power Africa Innovation Fair in the United Nations compound in Nairobi. Power Africa was Obama’s signature Africa initiative to help boost electrification across the continent and has had mixed impact depending on who you ask.\n But M-Kopa, which was just four years old at the time, has grown rapidly in that time, reflecting the broader progress in the sector as renewable energy solutions are increasingly adopted as viable workarounds to plug the wide gaps in electrification in Kenya and across the continent. Yet, a half decade later, there are fears that looming regulation in the East African country is signaling a possible shift in the government’s outlook on the sector.\nThose fears come in light of the latest annual report by Kenya Power, the national electricity company, which showed local demand growth for electricity lagged below the projected level of 5%. Even more crucial is the reason presented as a suspected cause of stunted demand. “Dampened demand growth is further compounded with the increased threats of grid defection by the industrial category as decentralized renewable energy options are becoming more available and cheaper,” the report stated.\nPut another way, more industrial customers in Kenya are now being powered by renewable energy sources—a stark reality for Kenya Power given that industrial customers account for 45% of its total revenues.\nIn the wake of the utility’s report, Kenya’s Energy and Petroleum Regulatory Authority is proposing rules for further regulation of importing, distributing, installing, and maintaining solar systems in the country. And, given the proximity of both events, the proposals have already been described as a protectionist attempt to “thwart” the penetration of solar power and preserve Kenya Power’s dwindling revenues. For its part however, EPRA has denied the suggested ulterior motives.\nBut while the regulator might indeed be without ulterior motives, the current realities of Kenya Power, and the impact of solar energy providers, offers a snapshot of a looming face-off between nascent renewable energy providers and struggling national utilities across the continent.\nChange-over\nThe obvious reason more industrial users of electricity are increasingly taking up the option of solar power is the cost implication. “On the cost curve, [solar] will get cheaper by 10%-15% every year, which is extraordinary and fundamentally disruptive to electricity,” says Matthew Tilleard, managing partner at CrossBoundary, a solar power provider for businesses which operates in nine African countries.\nThe switch by industrial players is not only happening in Kenya either. In Nigeria, off-grid energy firm Rensource is building a 700 kilowatt solar power plant for one of the country’s largest private farms. Further, middle-class home owners are also increasingly taking up the option of installing solar systems, as a complement to the national grid’s unstable electricity supply in some cases but as a complete replacement in others.\n“We could lose five or ten years worth of fixing electricity on the continent to bad regulation and special interests trying to hold on.”\nCompanies like M-Kopa and others offering pay-as-you-go solar solutions are also improving access to renewable energy by eliminating large upfront costs of purchase and installation through flexible payment plans based on the ability of consumers to buy what they can afford, rather than wait on an uncertain bills from national utilities.\nIncreasingly, these services are being delivered by solar powered mini-grids which power dozens or a few hundred households. The rapid growth of these mini-grids has coincided with a reduction in costs—the average price per connection dropped to around $700 last year down from around $1,600 earlier in the decade, according to data from the Africa Minigrid Developers Association.\nCapex outlay has more than halved in that time and the cost for new entrants has fallen by a third. The average installed costs is also said to have decreased by 65% to $6,200/kW in 2018 from $14,000/kW in 2015.\nAs such, taking up solar power over grid supply is a move not only driven by the notorious unreliability of national grids—coming under strain as many African countries’ populations have expanded quickly—but also by the simple fact national utilities cannot match the cost savings solar power providers promise, particularly over the long term. In fact, back in September, Nigeria was on the cusp of a nationwide strike after a nearly 100% increase in electricity tariffs. “It has become a no-brainer to clients to look at solar for power,” says Ademola Adesina, CEO of Rensource.\nOne way for large, inflexible utility companies to adapt to the changing trends is to seek opportunities for collaboration with private renewable energy providers, Adesina says. “It would be a better use of my time to deploy a 20 megawatt plant to power an entire community or industrial park [through national distribution companies] rather than doing smaller deals,” he tells Quartz Africa.\nThe potential cost savings solar energy providers promise will become even more crucial in the year ahead as the continent suffers a setback in electrification. Data from the International Energy Agency (IEA) show the number of people living without electricity in Africa is set to increase for the first time in eight years, and fall back to 2016 levels given the economic effects of the Covid-19 pandemic.\nWith IEA estimating that over 100 million people will be unable to afford basic electricity services across the continent due to dire economic straits, the appeal of cheaper, affordable solar power is likely to continue to rise.\nMind the gap\nAs governments across Africa contemplate the existential crisis their national electricity companies will face as the shift to solar continues, they will face some stark realities.\nWith nearly 600 million people without access to electricity, national grids are simply unable to generate and distribute enough power to match growing local demand. In South Africa, Africa’s most advanced economy, episodes of electricity blackouts—or “loadshedding,” as Eskom, the national power utility firm, calls it—have become increasingly normal. The pressures of catering to local demand has seen the job of chief executive at Eskom become a poisoned chalice of sorts over  the years.\nIn Nigeria, the use of expensively maintained petrol or diesel-powered generators as a key source of electricity has long been a feature of everyday life, despite the high expense of fossil fuels and accompanying costs of air pollution.\nConservative estimates by Access to Energy Institute (A2EI), a German-based non-profit, suggest Nigeria is home to 23 million small gasoline generators which have a capacity that’s eight times larger than the national power grid.\nWith such vast shortcomings, solar power can be more accurately described as being fundamental to the progress of electrification rather than a threat to a wobbling status quo. Indeed, some African countries have taken that view and are investing billions of dollars in taking advantage.\nIn 2016, Morocco connected Ouarzazate Solar Power Station, with an installed capacity of 160 megawatts, to its national grid as part of a target to generate 52% of its electricity through renewable energy sources by 2030.’\nMore recently, Nigeria has toed a slightly different path to deploying solar power as part of its national electrification policy: the government has announced a project that will see up to 25 million Nigerians in underserved and off-grid communities supplied with solar home systems through payment plans that will remove the upfront costs of purchase and installation.\nAs it turns out, the upsides that come with adopting renewable energy sources go well beyond electrification. Last year, a “job census” report by Power for All, a non-governmental organization focused on promoting renewable energy, showed that startups and other players in the space are creating jobs at a scale that’s already comparable to local utilities in Kenya and Nigeria.\nGiven obvious benefits, a protectionist recourse to preserving fading utilities at the expense of renewable energy upstarts might slow down growth in the sector but will ultimately prove futile, Tilleard says.\n“We could lose five or ten years worth of fixing electricity on the continent to bad regulation and special interests trying to hold on,” he tells Quartz Africa. “But the inevitability of current cost curves for this technology means we’ll end up in the same place—the question is if we’ll waste a lot of time getting there.”\nReference: Solar providers in Africa are on a collision course with struggling national grid companies",
        "date": "Dec. 11, 2020"
    },
    {
        "id": 3,
        "title":"Rensource and Premium Poultry Team up with empower to deploy solar Energy project to Poultry Farm ",
        "content": "Rensource, a leading West African renewable energy services provider, announced today its entrance into the provision of Commercial & Industrial (C&I) solar with a project in partnership with the Norwegian impact investment company, Empower New Energy, to deploy a 700 KWp solar photo-voltaic plant to Nigeria´s largest egg producer, Premium Poultry Farms. The power plant, ground-mounted on Premium Poultry’s farm, will generate ca. 1 gigawatt hour of clean energy annually, save up to 25 000 tons of CO2 in its lifetime and contribute to Abuja´s fight against local air pollution.\n This landmark project is one of the largest power purchase agreements for solar energy signed in the C&I sector in Nigeria and will represent the poultry industry’s largest single clean energy project. The power plant is expected to operate for at least 25 years, according to the power purchase agreement signed between the off-taker Premium Poultry and Empower. \n “This solution for Premium Poultry Farms, Nigeria’s largest egg producer, demonstrates our ability to meet the energy needs of a diverse array of industrial customers. We are honored to supply affordable clean energy to further grow Nigeria’s critically important agricultural sector, while cutting emissions” said Ademola Adesina, founder and CEO of Rensource.\n Premium Poultry Farms produces ca. 600 000 eggs daily and has its own feed mill, making it the country´s largest egg producer. The company prides itself in distributing and nourishing Nigerian families with quality eggs across the country. This project, which is due to commence operations in December 2020, will have an important footprint in terms of sustainability. It will save up to 840 tonnes of CO2 emissions per year and create 40 jobs during its construction and operations phase. \n Rensource is a leading West African provider of renewable energy related services. Rensource is focused on developing, financing, and managing critical infrastructure for African enterprises. The company is located in Lagos, Nigeria. \n About Premium Poultry Farms\n Premium Poultry Farms is one Nigeria’s largest poultry farms. The farm has the most automated operating process of any farm in the country and currently produces over six-hundred-thousand eggs daily. The farm is located in Abuja, Nigeria.\n About Empower New Energy (Empower)\n Empower New Energy is an award-winning impact investment company investing in small and medium-scale renewable energy projects across Africa through its investment vehicle Empower Invest. The investors in the fund include Norfund (Norway’s Investment Fund for developing countries), ElectriFI (the electrification Financing Initiative, funded by the EU) and a group of private impact investors. Empower operates from its offices in Oslo, London, Nairobi and Accra, and through local partners in Nigeria amongst others. \n Reference: Rensource and Premium Poultry Team Up With Empower to deploy Solar Energy Project to Poultry Farm",
        "date": "Dec. 7, 2020"
    },
    {
        "id": 4,
        "title":"Nigerian farm becomes country’s largest sun-powered poultry plant",
        "content": "The 700KWp ground-mounted solar photovoltaic plant for Nigeria’s largest egg producer, Premium Poultry Farms, will generate one gigawatt hour of clean energy annually. This will save up to 25,000 tons of CO2 in its lifetime, contributing to Abuja’s fight against local air pollution.\n The project marks the Nigerian poultry industry’s largest single clean energy project. The power plant is expected to operate for at least 25 years, according to the power purchase agreement signed between off-taker Premium Poultry and Norwegian impact investment company, Empower New Energy.\n Ademole Adesina, founder/CEO of West African renewable energy services provider Rensource: “This solution for Premium Poultry Farms, Nigeria’s largest egg producer, demonstrates our ability to meet the energy needs of a diverse array of industrial customers. We are honoured to supply affordable clean energy to further grow Nigeria’s critically important agricultural sector while cutting emissions\n Premium Poultry Farms produces 600,000 eggs daily and has its own feed mill. The solar plant project, which is due to start operations in December 2020. It is estimated the plant will create 40 jobs during its construction and operations phase.\n Alhaji Mahey Rasheed, Premium Poultry Farms chairman: “We take immense pride in being good stewards of the environment and are pleased to further enhance our efforts with this solution. Sustainability is at the heart of the farm’s philosophy. This project also allows us to benefit from the substantially lower energy costs offered by the solar PV technology and we are excited to become the largest solar-powered poultry farm in the country.”\n Solar for C&I market could drive clean energy transition of Sub Saharan Africa despite COVID-19 pandemic disruption\n A 2019 Bloomberg NEF report about the uptake of solar energy into the Sub-Saharan Africa C&I market pointed out that a combination of high electricity tariffs, falling PV prices and a lack of grid reliability was spurring sales of on-site solar to business customers. Solar for Business in sub-Saharan Africa found that the C&I market in SSA was growing, not because of regulatory support (as is the case in developed countries) but because of economics. Onsite solar power is cheaper than electricity tariffs paid by commercial or industrial clients in half of the markets studied by Bloomberg NEF.\n The COVID-19 pandemic though has since disrupted the energy sector and the International Energy Agency in its World Energy Report 2020 said it was too soon to say how the crises would affect the clean energy transition. Solar power was consistently at the heart of every scenario it posited though for the next decade. The IEA report pointed out that solar projects consistently offer some of the lowest-cost electricity ever and it would be the main driver of growth of power projects to meet global electricity needs in the foreseeable future.\n While institutions such as the World Bank and the AfDB are prioritising renewable energy development to address climate change the global pandemic has diverted funding in many African countries to address urgent healthcare and other socio-eonomic emergencies.\n Projects like this solar power plant for Premium Poultry Farms though, show the economic urgency of finding affordable power to run your business can still trump a lack of regulatory pressure.\n Reference: Nigerian Farm becomes Country's Largest Sun-Powered Poultry Plant",
        "date": "Dec. 4, 2020"
    },
    {
        "id": 5,
        "title":"Rensource Launches Digital Platform for SMEs",
        "content": "Targeted at the ease of doing business amidst the COVID-19 pandemic, a Nigeria-based provider of merchant infrastructure, Rensource, has launched a digital distribution platform, Merchlist, which seeks to help small and medium-scale retailers get discovered quickly while enabling servicing and fulfillment of customer orders online. Rensource, which launched in 2016 and raised $20 million in funding late 2019, is a renewable energy and merchant services company, powering the productivity of Small and Medium-scale Enterprises (SMEs) by building and operating clean energy-based micro-utilities for SME clusters in the country while offering value-added services to these merchants.\n Merchlist, rapidly developed by Rensource, aims to keep SMEs viable during the pandemic via two main features. “Buy” allows customers to purchase directly from SMEs, while “Discover” aggregates services, contact details and delivery methods, ensuring that end users can see service availability in real-time. During the COVID-19 lockdown in Nigeria, the startup hopes to further assist these businesses with its launch.\n Partner SMEs on Merchlist include Grocery Bazaar, Grand Square, Rx Pharmacy, Food Jaar and The Meat Shop. While the platform is currently in its beta testing stage, only accepting a limited number of orders per day, the company said plans are underway to roll out in additional markets across Nigeria, allowing more SMEs and merchants to go digital and access end-users.\n According to the startup’s Chief Operating Officer, Anu Adasolum, who issued a statement made available on the company’s website, recently, the company hopes to help SMEs succeed despite the lingering economic hardship on small businesses, occasioned by the pandemic.\n “At Rensource we are focused on connecting people to the most important things. Energy has always been our core business but in light of the pandemic, we see the opportunity to help small businesses who are the backbone of our economy survive by gaining access to consumers online. “The launch of Merchlist will ensure that small businesses stay in business and everyday consumers can continue to access essential goods. Merchlist aims to connect as many small businesses as possible to the millions of internet users in Nigeria– simply, easily and quickly,” said Adasolum.\n Reference: Rensource Launches Digital Platform for SMEs",
        "date": "May 8, 2020"
    },
    {
        "id": 6,
        "title":"Nigeria’s Rensource launches digital distribution platform for SMEs during lockdown ",
        "content": "Nigerian startup Rensource has launched a digital platform that helps small and medium-sized retailers get discovered quickly while enabling servicing and fulfillment of customer orders online during the national lockdown to combat the COVID-19 pandemic.\n Rensource, which launched in 2016 and raised US$20 million in funding late last year, is a renewable energy and merchant services company, powering the productivity of SMEs by building and operating clean energy based micro-utilities for SME clusters in the country, while offering value added services to these merchants.\n During the COVID-19 lockdown in Nigeria, the startup hopes to further assist these businesses with the launch of Merchlist. Rapidly developed by Rensource, it aims to keep SMEs viable during the pandemic via two main features. “Buy” allows customers to purchase directly from SMEs, while “Discover” aggregates services, contact details and delivery methods, ensuring that end users can see service availability in real-time.\n Partner SMEs on Merchlist include Grocery Bazaar, Grand Square, Rx Pharmacy, Food Jaar, and The Meat Shop. While the platform is currently in its beta testing stage, only accepting a limited number of orders per day, plans are underway to roll out in additional markets across Nigeria, allowing more SMEs and merchants to go digital and access end-users. \n “At Rensource we’re focused on connecting people to the most important things. Energy has always been our core business but in light of the pandemic, we see the opportunity to help small businesses who are the backbone of our economy survive by gaining access to consumers online,” said Anu Adasolum, the startup’s chief operating officer (COO). \n “The launch of Merchlist will ensure that small businesses stay in business and everyday consumers can continue to access essential goods. Merchlist aims to connect as many small businesses as possible to the millions of internet users in Nigeria– simply, easily and quickly.” \n Rensource has also launched a fund to support its merchant clusters during this period, with Donations by Merchlist providing food, essentials and medical supplies through various partner NGOs.\n Reference: Nigeria's Rensource Launches Diigital Distribution Platform for SMEs during Lockdown",
        "date": "April 16, 2020"
    },
    {
        "id": 7,
        "title":"RENSOURCE TO POWER NIGERIAN SME PRODUCTIVITY WITH $20 MILLION FUNDING",
        "content": "Renewable energy company, Rensource, on Wednesday announced it has secured $20 million in Series A equity round. This represents the largest ever funding for a Nigerian renewable energy start-up, the company said in a press release.\n Since its commercial launch in 2016, the firm has been providing energy and tech-enabled value services to small and medium-sized enterprises. The goal is to address West Africa’s power crisis – starting with Nigeria – by delivering renewable-based decentralized energy, with a primary focus on SMEs.\n Nigeria, which is Africa’s most populous country, only has 12 gigawatts of installed grid capacity. Just one in four Nigerians is connected to the national power grid, according to the firm. In contrast, South Africa has 50 gigawatts.\n “We believe that simultaneously greening and decentralizing its power infrastructure is the only way to navigate Nigeria out of its current state of energy poverty,” said Ademola Adesina, Founder and CEO of Rensource. “Pursuing this with a focus on the millions of small businesses that drive our economy creates a massive multiplier effect whose benefit accrues to all.”\n With the financing, the company plans to expand its presence across Nigeria, it said. Currently, Rensource is active in marketplaces that serve over 30,000 SMEs, operating in seven clusters across six states in Nigeria – Lagos, Kano, Ogun, Ondo, Oyo, and Edo state.\n It builds and operates solar hybrid micro utilities – a type of energy services provider that localizes energy generation, distribution, and customer service to each community it serves. Rensource has a target of expanding into 100 markets in the country over the next three years.\n The fresh cash injection will also be deployed as investments in additional technology infrastructure beyond energy, as Rensource rolls out new tech-enabled products and services for its merchants.\n The startup is entering Nigeria’s nascent offline to online (O2O) space with the launch of its new B2B platform, Spaces O2O, a project created to address the holes in Nigeria’s fragmented supply chain.\n Some of the identified gaps in the distribution value chain include lack of access to credit, expensive transportation and warehousing, inaccurate data and limited product availability, underpinned by a highly fragmented and multi-layered value chain. With the new platform, merchants will be able to access services that accelerate their productivity growth.\n “Our push into O2O is a natural step that leverages our existing infrastructure to further empower the merchants we serve,” the CEO said, adding that Rensource aims to connect over one million merchants in the next five years.\n “Rensource’s goal is to offer solutions to the many challenges faced by SMEs in Nigeria, starting with power and expanding to other value-added services,” said Pardon Makumbe, Co-founder and Managing Partner of CRE Venture Capital, an existing investor in the startup and a leader in the financing round.\n “It is a bold and worthwhile undertaking that is creating value for all stakeholders. We are excited to continue this journey with the hyper-competent team at the helm,” Makumbe added. The funding was co-led by the Omidyar Network, with participation from Inspired Evolution, Proparco, EDPR, I&P, Sin Capital, and Yuzura Honda.\n Founded by Ademola Adesina and Jussi Savukoski, Rensource is a leading renewable energy and merchant services company revolutionizing energy provision in Africa by building and operating clean energy-based micro utilities for SME clusters in Nigeria.\n Rensource has historically worked with a variety of stakeholders to build renewable energy projects across Nigeria. In 2018, the company partnered with the federal government’s Rural Electrification Agency, to develop a project in Kano which resulted in thousands of merchants connecting to Nigeria’s first solar micro utility.\n Reference: Rensource to Power Nigerian SME Productivity with $20 Million Funding",
        "date": "December 18, 2019"
    },
    {
        "id": 8,
        "title":"Nigeria’s Rensource raises $20M to power African markets by solar ",
        "content": "Nigerian startup Rensource Energy has raised a $20 million Series A round co-led by CRE Venture Capital and the Omidyar network.\n The renewable energy company builds and operates solar-powered micro-utilities that provide electricity to commercial community structures, such as open-air trading bazaars.\n Launched in 2016, the startup has shifted its operating strategy. “We’ve pivoted away from a residential focus…and we’re building much larger systems to become essentially the utility for these large urban markets we have a lot of in Nigeria,” Rensource co-founder Ademola Adesina told TechCrunch.\n The company has a partnership with German manufacturer BOS AG, with whom it designs specialized panels for it use case. Rensource also has developer teams in Nigeria and Europe for its software-related programs.\n In addition to becoming a micro-energy provider to Nigeria’s robust SME classes, the startup aims to offer them B2B services. With the $20 million round, Rensource is launching its Spaces Offline to Online platform for supply-chain services, including business-analytics and working capital options.\n “It’s a mini-ERP tool. We’re trying to bring a universe of people who are banked, but…still offline — their products are offline, they don’t track anything, and there’s no data behind their business — online,” said Adesina.\n The benefit Rensource seeks to deliver to Nigeria’s SMEs — at a profit for itself — is to lower overhead costs through better business practices and free them from the bane of generators.\n Across marketplaces in West Africa, noisy, fuel-guzzling and pollution-producing generators are like an unwelcome, yet necessary business partner.\n Lack of affordable and reliable electricity in Nigeria creates a massive real and opportunity cost to Africa’s largest economy.\n For perspective, the West African country is roughly the size of Texas, with a 200 million population larger than Russia, and generates less gigawatt hours of electricity annually than the U.S. state of Connecticut.\n Nigerian businesses (and citizens) adjust for these power deficiencies by spending on diesel fuel and generators.\n The IMF’s 2019 Nigeria report quoted economic losses of $29 billion in Nigeria due to unreliable electricity supply. On global Doing Business rankings, Nigeria ranked 169 out of 190 countries in the category of “Getting Electricity.”\n This difficulty and cost weighs particularly heavy on Nigeria (and the continent’s) SMEs, which often operate in Africa’s informal economy — projected to be one of the largest off-the grid commercial spaces in the world.\n Rensource’s micro-utility model deploys power clusters — made up of solar-panels, batteries and a power management system — adjacent to markets and commercial hubs. The energy application isn’t totally clean, as the startup still uses its own diesel backup system.\n Rensourse has used this model to become an off-grid energy provider in six states in Nigeria, and powers the Sabon Gari market — one of the country’s largest, located in northern Kano State.\n The company plans to expand to 100 markets within Nigeria and to additional African countries within 24 months, according to Adesina.\n Rensource generates revenue from charging merchants daily, weekly or monthly fees. “In 2017, we did a few hundred thousand dollars in revenue. Last year we did about $7 million in revenue, and this year we’ll do better than that,” Adesina said.\n The company doesn’t release official financials, but generated a small profit last year, according to Adesina. He named deploying more of its micro-utilities to new markets and diversifying services as the path to long-term profitability.\n Rensource differentiates itself from many home-kit solar energy startups in Africa, such as M-Kopa, by becoming a renewable energy utility at scale.\n The startup’s CEO sees the model as a classic leapfrog tech business, effectively bypassing Nigeria’s deficient electricity grid and providing a less capital intensive alternative to large (and often complicated) energy infrastructure projects.\n Rensource is also following a trend by some Nigeria-based startups, such as trucking-logistics company Kobo360 and motorcycle ride-hail company Gokada, to shape a suite of additional services around the needs of core clients.\n In Rensource’s case, those clients are SMEs and traders in the informal economy. “This informality of theirs is what we see as an opportunity in building this new business line and bringing these [merchants] into the online world,” said Adesina.\n Reference: Rensource raises $20M to Power African Markets by Solar",
        "date": "Dec. 18, 2019"
    },
    {
        "id": 9,
        "title":"A Nigerian off-grid solar startup has raised $20 million to power local markets and merchants ",
        "content": "The funding pitch for off-grid energy companies across Africa can be boiled down to one poignant statistic: the continent is home to world’s slowest electrification rate.The problem is most significant in Nigeria, Africa’s most populous country, which holds the largest population living without access to electricity. Given the high cost connecting tens of millions of homes to an overwhelmed national grid, off-grid and renewable energy companies and the market opportunity they represent are proving a big draw for investors.Rensource, a three-year old off-grid solar energy firm has raised $20 million in a Series A round jointly led by African venture capital fund, CRE Venture Capital and impact investor, the Omidyar Network. The round also saw participation from Inspired Evolution, Proparco,  EDPR, I&P, Sin Capital, and Yuzura Honda.Rensource’s funding round follows sustained investor interest in Africa-focused off-grid and renewable energy startups seeking to plug electricity gaps. In June, Arnergy, another solar mini-grid company, also raised $9 million in its Series A round.While most off-grid companies offer the promise of electrifying homes and residential communities, Rensource focuses solely on powering local markets and merchant shops. “We decided that the better way to scale the market opportunity is by focusing on small businesses, specifically merchants in large urban markets in Nigeria,” says Ademola Adesina, Rensource founder and CEO.In Nigeria, like many other African countries, large, open markets are key drivers of economic activity in the local, and ultimately, national economy. This is why Rensource is essentially positioning itself as a micro-utility for large market spaces from financing installation to billing merchants and providing on-site customer service in seven market clusters across Nigeria.With the national grid unable to either generate or distribute enough power to match local demand, off-grid systems offer the prospect of reliable supply. And for businesses, that means reduced spending on expensively maintained power generators and more operational efficiency. The reduced reliance on diesel and petrol generators could have to side benefit of reducing the risk of fatal fire outbreaks which have become a frequent occurrence in Nigeria’s congested markets. There have been two major fire outbreaks in one of Lagos’ biggest markets just in the last month.Buoyed by its new funding, Adesina says Rensource now plans to double-down on its focus on merchants and markets even beyond powering them. “Because we’re basically billing and engaging the customers we provide energy to, we’ve also come to understand a lot of their other pain points.  We are about to start rolling out tools for those same merchants to bring them more into the formal economy, allowing them to do inventory management, accounting and track sales,” he says.Despite the potential of off-grid and renewable energy companies, government regulation is often cited as a major stumbling block to progress across the continent. But Nigeria is an outlier in this regard: “The regulators have been very accommodating in ensuring none of their regulations hamstring us because ultimately they want to see more power,” Adesina says. “Relative to other sectors, they’re pretty hands-off on off-grid power and that’s because they know they can’t do it themselves.”Reference: A Nigerian off-grid startup has raised $20 million to power local markets and merchants",
        "date": "Dec. 18, 2019"
    },
    {
        "id": 10,
        "title":"Renewable energy is the only way to fuel African growth",
        "content": "Public-private partnerships are proving to be an effective way of solving Nigeria's energy supply crisis\n My country, Nigeria, will soon become the third most populous country in the world, reaching a forecast 400 million people in 2050. This demographic growth is happening at an incredible speed.\n Elderly residents of Lagos will tell you their memories of their home town in the days when the number of inhabitants did not even reach one million. Today, it is a 20-million metropolis that never ever rests. \n The fast pace of population growth is posing enormous challenges. This relatively young country urgently has to stimulate domestic industries that employ people and thus contribute to inclusive economic growth. However, if it is to grow, Nigeria needs energy. \n At times, Nigeria’s generating companies can only provide around 3,000MWh of electricity. By comparison, South Africa, home to approximately a third as many people, produces 50,000MWh.\n Only one in four Nigerians is connected to the national power grid. And even those who are connected experience daily power cuts.\n As a result, Nigeria is the world’s largest importer of power generators fuelled by expensive and polluting diesel. The sheer number of them already threatens the health of millions of Nigerians, the world’s climate and its global commons. And so long as the current energy supply crisis persists, the country’s economy will not be able to keep step with its rapid demographic growth. \n What is the solution? Renewable energy sources are environmentally sustainable, financially affordable – and, after all, Nigeria is richly endowed with water and sun. \n But however brightly the sun shines from the sky, it will not solve the problem alone. Many African states partially privatised their energy sectors in the early 2000s in an attempt to incentivise efficiency. Yet restructuring the ever more dilapidated energy sector needs capital, which both foreign and domestic investors are often hesitant to provide.\n Past experiences have resulted in a lack of return on investment, and governments have often failed to give strong signals of being willing to enforce plans and agreements. This has shaped the perception that if innovation in Africa’s energy sector is to occur at all, it will be in spite of, not because of, government involvement.\n Providing stable energy supplies on this scale clearly demands the involvement of political actors. Despite the many pitfalls and failures, public-private partnerships can work – and if they do, they provide impressive results. The Sabon Gari micro-utility project in Kano, the country’s largest city after Lagos, is one of these. \n Sabon Gari is one of Nigeria’s largest markets, with more than 10,000 merchants selling a wide variety of goods and services. Previously, market sellers had to pay up to half their income to fuel the diesel generators that kept their businesses running. \n Through a partnership of my company, Rensource, with the federal government’s Rural Electrification Agency (REA) led by Damilola Ogunbiyi, widely considered one of the country’s most effective technocrats, thousands of microenterprises in the market were connected to Nigeria’s first solar micro-utility.\n Their costs for power decreased by more than 30 per cent and reliability increased. And, so far, the Sabon Gari project has created more than 200 skilled jobs, with potential for more as it expands. \n The REA’s energising economies initiative, which facilitates market access for private sector actors such as Rensource, made success possible much more quickly than if we had to act alone.\n The agency conducted a preliminary power audit in several major urban markets around Nigeria to determine the energy needs of small business owners and their levels of spending on electricity.\n This information was crucial for my team to identify both the energy demand and at what price point small business people would be willing to switch from diesel-fuelled generators to solar power.\n And the REA also helped us to navigate complex government permitting processes and reduced red tape so we could develop and finance the project much faster and efficiently than if it had not been involved.\n The solid and transparent partnership between us also boosted investor confidence. We were able to raise several million dollars in initial funding for the project from global investors, which we used to import solar panels, various power electronics and storage technology. \n The Sabon Gari market in Kano is showing what can be achieved if the government and the private sector can leverage their respective strengths to drive innovation and inclusive economic growth. \n I view this as only the start. We have ambitious plans to construct micro-utilities in other peri-urban and rural areas that lack sufficient grid access.\n We are excited about the ripple effects stemming from reduced energy costs for microbusiness owners, as well as the benefits for clean air and a healthy climate. Business owners with lower overheads will be able to reinvest their hard-earned money, creating more jobs.\n A Nigerian diplomat and former Commonwealth secretary-general, Chief Emeka Anyaoku, once spoke of the country as a car able to run at 200 km/h but moving at only a tenth of that speed. If we can build on transparent public-private partnerships, Nigeria has the potential to overcome its challenges and emerge as a globally significant player. \n Reference: Renewable energy is the only way to fuel African growth",
        "date": "Jul. 5, 2019"
    },
    {
        "id": 11,
        "title":"Rensource wins FT/IFC Transformational Business Awards",
        "content": "Rensource Distributed Energy Limited has been given an award by the International Finance Corporation and the Financial Times Newspaper, FT, for its role in reversing power shortages in Nigeria through the provision of affordable power solutions.\n In a statement by Rensource, the company clinched the ‘Excellence in Climate Solutions’ award, at the Transformational Business Awards, also known as ‘the Oscars of the renewables world’, held in London. The award was organised by the International Finance Corporation (World Bank Group) and Financial Times.\n Rensource Distributed Energy, the statement noted, won the ‘climate solutions award and was given special mention for its work in the ‘Transformational Solutions in Urban Infrastructure and the Climate Solutions’.\n The company was also recognized for its work in reversing the trend of power shortages in Nigeria which keeps hurting businesses and households, by delivering low-cost, fixed-price energy to urban Small and Medium Scale Enterprises, SME, and households with solar-hybrid mini-grids.\n “The Transformational Business Awards is an impact-driven award set up by the IFC, which is an arm of the World Bank Group and The Financial Times (FT) newspaper. The awards pinpoint the crucial role of private sector initiatives and capital in efforts to attain the United Nations Sustainable Development Goals (SDGs) — a blueprint set out by the UN to achieve a more sustainable future and address climate change,” the company explained.\n Reference: Rensource wins FT/IFC Transformational Business Awa\n ",
        "date": "June 23, 2021"
    },
    {
        "id": 12,
        "title":"Rensource launches first solar micro-utility project in Nigeria",
        "content": "The Lagos-based distributed energy provider Rensource has launched Nigeria’s first solar micro-utility project under Powered by Rensource, a new B2B-focused offering for investors and developers.\n This first Powered by Rensource project debuted on February 8 at the Sabon Gari Market, where Rensource introduced Sabon Gari Energy, a micro-utility project that will provide power to over 12,000 shops in Kano, Nigeria’s second largest city.\n Rensource, which raised $3.5 million funding earlier this year from Amaya Capital, Omidyar Network and Sissli Limited, is Nigeria’s fastest growing provider of off-grid power. It offers clean, reliable power to consumers, small businesses and industrial clients through its subscription-based Power-as-a-Service (PaaS) model using solar-hybrid systems installed on the user’s premises.\n Powered by Rensource allows interested parties to take advantage of Rensource’s technology infrastructure, operational capacity, and financing to establish micro-utilities in localities throughout Nigeria.\n In doing so, Rensource is leveraging its platform to enable consumers and businesses to achieve energy independence. The startup aims to make Nigeria the first country in the world to rely predominantly on distributed, renewables-based power generation.\n “Rensource is delighted to leverage our technology infrastructure and operational capabilities towards demonstrating the viability of the sustainable, clean, and cost-effective provision of power for the shop owners at Sabon Gari Market,” said Ademola Adesina, founder and chief executive officer (CEO) of Rensource.\n Sabon Gari, one of the largest multi-purpose markets in Kano state, is one of the pioneer markets under the Energising Economies Initiative (EEI) of the Rural Electrification Agency. The EEI strives to showcase the transformative impact of providing efficient, clean, and sustainable power to strategic economic clusters across Nigeria, and to showcase the financial viability of these clusters to the private sector.\n “Developing the first and largest virtual power plant in Africa is extremely exciting,” said Damilola Ogunbiyi, managing director and CEO of the Rural Electrification Agency. “When the project is completed, the 1.3 MW of standalone solar system project will generate clean and sustainable energy to over 12,000 SMEs.”\n Reference: Rensource launches first solar micro-utility project in Nigeria",
        "date": "March 12, 2018"
    }
    
]